---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHost
source: html/d81426a6-4768-a26e-ad04-af1dc4c7f49d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHost Property

Rebar can be placed only in Concrete Structural elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRebarHost { get; }
```